src/config/AccountingRegisters/Хозрасчетный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<AccountingRegister>
		<Properties>
			<Name>Хозрасчетный</Name>
			<ChartOfAccounts>ChartOfAccounts.Хозрасчетный</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НалоговоеНазначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НалоговыеНазначенияАктивовИЗатрат</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Валютный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Количественный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Количественный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЖурнала</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДополнительный</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеКорректироватьСтоимостьАвтоматически</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерИсходнойПроводки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

src/config/Enums/ВидыЕСВ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ВидыЕСВ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОсновнаяЗарплата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоДоговорамГПХ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоГигКонтрактам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Больничные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Декретные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачисленияМобилизованным</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеУчитывается</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/config/CommonModules/а_1ДФ/Ext/Module.bsl
Функция ТекстЗапросаВТПериодыГПХ() Экспорт
	
	Возврат "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПоступлениеТоваровУслуг.Контрагент КАК ФизическоеЛицо,
	|	ПоступлениеТоваровУслуг.ДоговорКонтрагента.Дата КАК ДатаНачала,
	|	ПоступлениеТоваровУслуг.ДоговорКонтрагента.а_ДатаОкончания КАК ДатаОкончания
	|ПОМЕСТИТЬ ВТПериодыГПХ
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(&ДатаНач, &ДатаКон, Регистратор, , , СчетКт.Код = ""651"", , Организация = &Организация) КАК ХозрасчетныйОборотыДтКт
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
	|		ПО ХозрасчетныйОборотыДтКт.Регистратор = ПоступлениеТоваровУслуг.Ссылка
	|ГДЕ
	|	ХозрасчетныйОборотыДтКт.Регистратор ССЫЛКА Документ.ПоступлениеТоваровУслуг
	|
	|";
	
КонецФункции 

Функция ТектДополненияЗапросаЕСВГПХ() Экспорт
	Возврат "
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПоступлениеТоваровУслуг.Контрагент,
	|	ПоступлениеТоваровУслуг.Контрагент.КодПоЕДРПОУ,
	|	0,  
	|	НАЧАЛОПЕРИОДА(&ДатаНач, МЕСЯЦ),
	|	26,
	|	1,	
	|	ГПХФИО.Фамилия, 
	|	ГПХФИО.Имя,	
	|	ГПХФИО.Отчество,	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыЕСВ.ПоДоговорамГПХ) КАК ВидЕСВ, 
	|	СУММА(ВЫРАЗИТЬ(ПоступлениеТоваровУслуг.СуммаДокумента * 0.22 КАК ЧИСЛО(15,2))) КАК НалогФОТ, 
	|	0, 
	|	СУММА(ПоступлениеТоваровУслуг.СуммаДокумента), 
	|	СУММА(ПоступлениеТоваровУслуг.СуммаДокумента), 
	|	0, 
	|	0, 
	|	0, 
	|	NULL, 
	|	NULL, 
	|	0, 
	|	0,  
	|	0, 
	|	NULL, 
	|	0, 
//	|   ДлительностьТО.ПоДоговоруДни,
		|	ВЫБОР
		|		КОГДА ПериодыТО.ДатаНачала <> ДАТАВРЕМЯ(1, 1, 1)
		|				ИЛИ ПериодыТО.ДатаОкончания <> ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ВЫБОР
		|					КОГДА ПериодыТО.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
		|						ТОГДА &ДнейВМесяце
		|					КОГДА ПериодыТО.ДатаОкончания > КОНЕЦПЕРИОДА(&ДатаНач, МЕСЯЦ)
		|						ТОГДА &ДнейВМесяце
		|				ИНАЧЕ ДЕНЬ(ПериодыТО.ДатаОкончания)
		|				КОНЕЦ - ВЫБОР
		|					КОГДА ПериодыТО.ДатаНачала = ДАТАВРЕМЯ(1, 1, 1) ИЛИ ПериодыТО.ДатаНачала < &ДатаНач 
		|						ТОГДА 1
		|					ИНАЧЕ ДЕНЬ(ПериодыТО.ДатаНачала)
		|				КОНЕЦ + 1
		|		ИНАЧЕ &ДнейВМесяце
		|	КОНЕЦ,
//
	|   0,
	|   0
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(&ДатаНач, &ДатаКон, Регистратор, , , СчетКт.Код = ""651"", , Организация = &Организация) КАК ХозрасчетныйОборотыДтКт
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТГПХФИО КАК ГПХФИО
	|			ПО ГПХФИО.ФизическоеЛицо = ПоступлениеТоваровУслуг.Контрагент
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТПериодыГПХ КАК ПериодыТО
	|			ПО ПоступлениеТоваровУслуг.Контрагент = ПериодыТО.ФизическоеЛицо
	|		ПО ХозрасчетныйОборотыДтКт.Регистратор = ПоступлениеТоваровУслуг.Ссылка
	|ГДЕ
	|	ХозрасчетныйОборотыДтКт.Регистратор ССЫЛКА Документ.ПоступлениеТоваровУслуг
	|СГРУППИРОВАТЬ ПО
	|	ПоступлениеТоваровУслуг.Контрагент,
	|	ПоступлениеТоваровУслуг.Контрагент.КодПоЕДРПОУ,
	|  	ГПХФИО.Фамилия,
	|	ГПХФИО.Имя,
	|	ГПХФИО.Отчество,
	|	ВЫБОР
	|		КОГДА ПериодыТО.ДатаНачала <> ДАТАВРЕМЯ(1, 1, 1)
	|				ИЛИ ПериодыТО.ДатаОкончания <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ВЫБОР
	|					КОГДА ПериодыТО.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
	|						ТОГДА &ДнейВМесяце
	|					КОГДА ПериодыТО.ДатаОкончания > КОНЕЦПЕРИОДА(&ДатаНач, МЕСЯЦ)
	|						ТОГДА &ДнейВМесяце
	|				ИНАЧЕ ДЕНЬ(ПериодыТО.ДатаОкончания)
	|				КОНЕЦ - ВЫБОР
	|					КОГДА ПериодыТО.ДатаНачала = ДАТАВРЕМЯ(1, 1, 1) ИЛИ ПериодыТО.ДатаНачала < &ДатаНач 
	|						ТОГДА 1
	|					ИНАЧЕ ДЕНЬ(ПериодыТО.ДатаНачала)
	|				КОНЕЦ + 1
	|		ИНАЧЕ &ДнейВМесяце
	|	КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО";
КонецФункции

Функция ТекстДополненияЗапросаТаблица5() Экспорт
	
	Возврат "
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПоступлениеТоваровУслуг.Контрагент,
	|	1,
	|	0,
	|	3,
	|	ПоступлениеТоваровУслуг.Контрагент.КодПоЕДРПОУ,
	|	ГПХФИО.Фамилия, 
	|	ГПХФИО.Имя,	
	|	ГПХФИО.Отчество,
	|	ГПХФИО.ДатаНачала,
	|	ВЫБОР КОГДА ГПХФИО.ДатаОкончания > &ДатаКон ТОГДА ДАТАВРЕМЯ(1,1,1) ИНАЧЕ ГПХФИО.ДатаОкончания КОНЕЦ,
	|   ВЫБОР 
	|   	КОГДА ГПХФИО.ДатаНачала = ДАТАВРЕМЯ(1,1,1)
	|   	 ТОГДА ГПХФИО.ДатаОкончания
	|   	 ИНАЧЕ ГПХФИО.ДатаНачала
	|   КОНЕЦ КАК ДатаСортировки,
	|	0,
	|	0,
	|	"""",
	|	"""",
	|	"""",
	|	ПоступлениеТоваровУслуг.ДоговорКонтрагента.Номер,
	|	ВЫБОР КОГДА ГПХФИО.ДатаОкончания > &ДатаКон ТОГДА ДАТАВРЕМЯ(1,1,1) ИНАЧЕ ГПХФИО.ДатаОкончания КОНЕЦ,
	|	ВЫБОР КОГДА ГПХФИО.ДатаОкончания > &ДатаКон ТОГДА """" ИНАЧЕ ""ст.846 ЦКУ"" КОНЕЦ,
	|	ДАТАВРЕМЯ(1,1,1)	
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(&ДатаНач, &ДатаКон, Регистратор, , , СчетКт.Код = ""651"", , Организация = &Организация) КАК ХозрасчетныйОборотыДтКт
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТГПХФИО КАК ГПХФИО
	|			ПО ГПХФИО.ФизическоеЛицо = ПоступлениеТоваровУслуг.Контрагент
	|		ПО ХозрасчетныйОборотыДтКт.Регистратор = ПоступлениеТоваровУслуг.Ссылка
	|ГДЕ
	|	ХозрасчетныйОборотыДтКт.Регистратор ССЫЛКА Документ.ПоступлениеТоваровУслуг
	|СГРУППИРОВАТЬ ПО
	|	ПоступлениеТоваровУслуг.Контрагент,
	|	ПоступлениеТоваровУслуг.Контрагент.КодПоЕДРПОУ,
	|	ГПХФИО.Фамилия, 
	|	ГПХФИО.Имя,	
	|	ГПХФИО.Отчество,
	|	ГПХФИО.ДатаНачала,
	|	ВЫБОР КОГДА ГПХФИО.ДатаОкончания > &ДатаКон ТОГДА ДАТАВРЕМЯ(1,1,1) ИНАЧЕ ГПХФИО.ДатаОкончания КОНЕЦ,
	|   ВЫБОР 
	|   	КОГДА ГПХФИО.ДатаНачала = ДАТАВРЕМЯ(1,1,1)
	|   	 ТОГДА ГПХФИО.ДатаОкончания
	|   	 ИНАЧЕ ГПХФИО.ДатаНачала
	|   КОНЕЦ,
	|	ПоступлениеТоваровУслуг.ДоговорКонтрагента.Номер,
	|	ВЫБОР КОГДА ГПХФИО.ДатаОкончания > &ДатаКон ТОГДА ДАТАВРЕМЯ(1,1,1) ИНАЧЕ ГПХФИО.ДатаОкончания КОНЕЦ,
	|	ВЫБОР КОГДА ГПХФИО.ДатаОкончания > &ДатаКон ТОГДА """" ИНАЧЕ ""ст.846 ЦКУ"" КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО";
	
КонецФункции

Процедура СоздатьВТГПХФИО(Запрос) Экспорт
	
	тз = Новый ТаблицаЗначений;
	Если Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("ВТПериодыГПХ") = Неопределено Тогда
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	ПоступлениеТоваровУслуг.Контрагент КАК ФизическоеЛицо,
		               |	ПоступлениеТоваровУслуг.ДоговорКонтрагента.Дата КАК ДатаНачала,
		               |	ПоступлениеТоваровУслуг.ДоговорКонтрагента.а_ДатаОкончания КАК ДатаОкончания
		               |ИЗ
		               |	РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(&ДатаНач, &ДатаКон, Регистратор, , , СчетКт.Код = ""651"", , Организация = &Организация) КАК ХозрасчетныйОборотыДтКт
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
		               |		ПО ХозрасчетныйОборотыДтКт.Регистратор = ПоступлениеТоваровУслуг.Ссылка
		               |ГДЕ
		               |	ХозрасчетныйОборотыДтКт.Регистратор ССЫЛКА Документ.ПоступлениеТоваровУслуг";
		тз = Запрос.Выполнить().Выгрузить();
	Иначе
		тз = Запрос.МенеджерВременныхТаблиц.Таблицы["ВТПериодыГПХ"].ПолучитьДанные().Выгрузить();
	КонецЕсли;
	
	Если тз.Колонки.Найти("ФизическоеЛицо") = Неопределено Тогда
		тз.Колонки.Добавить("ФизическоеЛицо", ПолучитьОписаниеТипа(Тип("СправочникСсылка.Контрагенты")));
	КонецЕсли;
	
	тз.Колонки.Добавить("Фамилия", ПолучитьОписаниеТипа(Тип("Строка"), Новый КвалификаторыСтроки(100)));
	тз.Колонки.Добавить("Имя", ПолучитьОписаниеТипа(Тип("Строка"), Новый КвалификаторыСтроки(100)));
	тз.Колонки.Добавить("Отчество", ПолучитьОписаниеТипа(Тип("Строка"), Новый КвалификаторыСтроки(100)));
	Для Каждого СтрТз Из тз Цикл
		Если Не ЗначениеЗаполнено(СтрТз.ФизическоеЛицо) Тогда
			Продолжить;
		КонецЕсли;
		
		ФИО = ФизическиеЛицаКлиентСервер.ЧастиИмени(СтрТз.ФизическоеЛицо.НаименованиеПолное);
		ЗаполнитьЗначенияСвойств(СтрТз, ФИО);
	КонецЦикла;
	
	Запрос.Текст = "ВЫБРАТЬ * 
	|ПОМЕСТИТЬ ВТГПХФИО
	|ИЗ &Таб КАК Т";
	Запрос.УстановитьПараметр("Таб", тз);
	
	Запрос.Выполнить();

КонецПроцедуры

Функция ПолучитьОписаниеТипа(Тип, Квалификатор = Неопределено)
	
	Если ТипЗнч(Тип) = Тип("Массив") Тогда
		МассивТипов = Тип;
	ИначеЕсли ТипЗнч(Тип) = Тип("Структура") Тогда
		МассивТипов = Новый Массив;
		Для Каждого КиЗ Из Тип Цикл
			МассивТипов.Добавить(КиЗ.Значение);
		КонецЦикла;
	Иначе
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(Тип);
	КонецЕсли;
	
	Возврат Новый ОписаниеТипов(МассивТипов,,, Квалификатор);
	
КонецФункции
